[
    {
        "title": "Breaking News, Latest News and Videos | CNN",
        "contents": "Russia fines Google $20,000,000,000,000,000,000,000,000,000,000,000",
        "url": "https://edition.cnn.com",
        "label": 0
    },
    {
        "title": "Americas news - breaking news, video, headlines and opinion | CNN",
        "contents": "The CIA, a Navy Seal and a $15M bounty. This alleged plot on Venezuela’s Maduro reads like a Hollywood script, for a reason",
        "url": "https://edition.cnn.com/world/americas",
        "label": 0
    },
    {
        "title": "US Sports | CNN",
        "contents": "Commanders win on last-second Hail Mary, 49ers pile more misery on Cowboys, late drama throughout: NFL Week 8 Sunday review",
        "url": "https://edition.cnn.com/sport/us-sports",
        "label": 0
    },
    {
        "title": "CNN Political Briefing - Podcast on CNN Audio",
        "contents": "Polls show the divide in how American men and women vote could be bigger than ever this year—and longtime Democratic strategist and pollster Celinda Lake thinks the outcome of this race will be up to the women. She joins CNN Political Director David Chalian to discuss what she calls this election’s “gender chasm” that’s given former President Donald Trump the edge with men and Vice President Kamala Harris the advantage with women. They discuss why the gender gap exists—and if it’s here to stay. She also explains how Democrats are reaching women who might be interested in voting for Harris but are hesitant to vote differently from their Trump-supporting husbands. Nov 1, 2024 The days before an election always bring uncertainty, but that’s especially true this year, with polls showing a near deadlock between Vice President Kamala Harris and former President Donald Trump. This week, Republican pollster and CNN Political Commentator Kristen Soltis Anderson joins CNN Political Director David Chalian. They discuss the ever-changing electorate, what makes this year’s polling unique and why she thinks it’s “irresponsible” to make any predictions right now about what will happen on Election Day. Plus, she explains the two X-factors pollsters could have miscalculated this year. Oct 25, 2024 Early in-person voting started this week in Georgia and North Carolina, and it won’t be long until voters nationwide are lining up at polling places on November 5. So, do election officials feel ready? CNN Political Correspondent Sara Murray has been reporting on how communities across the country are preparing for Election Day. She joins CNN Political Director David Chalian to discuss what election officials are doing to combat disinformation and avoid repeating problems from 2020. They also discuss the “neighborhood fights” playing out in Wisconsin over ballot drop boxes and why you shouldn’t be surprised if tallying votes in Pennsylvania takes a long time. Oct 18, 2024 Election Day is just a little over three weeks away, and there’s still no clear leader in this race. With Vice President Kamala Harris and former President Donald Trump still neck-and-neck, all eyes are on the battleground states. Doug Sosnik is a longtime Democratic strategist who’s known for his deep-dive political memos. He joins CNN Political Director David Chalian to share his insights on the current state of play and why he thinks the next 25 days are all about Harris’ ability to close the deal with voters who may not feel naturally aligned with her. He also explains why this election could yield the biggest gender gap in American political history. Oct 11, 2024 This could be a historic election when it comes to the gender gap. Women have strongly supported Vice President Kamala Harris while former President Donald Trump holds a significant advantage with men. And while women’s rights have been front-and-center in this election, the race has also raised questions about masculinity and male voters. Richard Reeves is the founding president of the American Institute for Boys and Men, a think tank that does non-partisan research on the wellbeing of boys and...Show more men in the US. He joins CNN Political Director David Chalian to discuss the different models of American manhood on display in the race and why he thinks some male voters are feeling “politically homeless” during this election. Oct 4, 2024 Earlier this year, enthusiasm for a rematch between President Joe Biden and former President Donald Trump was low with Gen Z voters. It looked unlikely young voters would repeat their record turnout from 2020. But, there are signs of renewed excitement amongst the 18-to-29-year-old set with Vice President Kamala Harris at the top of the ticket. A new Harvard Youth Poll this week showed that shift, with Harris commanding a 31-point lead among likely voters under 30. John Della Volpe is the direct...Show moreor of polling at the Harvard Kennedy School Institute of Politics. He joins CNN Political Director David Chalian to talk about Gen Z voters. They discuss the enthusiasm gap between young Democrats and young Republicans, how memes influenced Gen Z’s perceptions of Harris and a somewhat surprising issue that polls well with young voters. Sep 27, 2024 This was a pivotal week for the US economy. The Fed announced its first interest rate cut since the pandemic — and it was a big one. Voters say they're thinking a lot about the economy during this election. In poll after poll, issues related to the economy rank at the top of voters’ priority lists. Catherine Rampell is an opinion columnist for the Washington Post and an economic and political commentator for CNN. She joined CNN Political Director David Chalian to talk about this week’s Fed decision, how Americans are feeling about their finances and what economists have to say about the presidential candidates’ plans for the economy. Sep 20, 2024 Former President Donald Trump and Vice President Kamala Harris faced off on the debate stage for the first time this week. Harris landed jabs, and Trump struggled to stay on-message. But will their performances move the needle in this extremely tight race? And what should Harris’ and Trump’s campaigns focus on now with the big debate behind them? Karen Finney is a CNN political commentator and was senior spokesperson for Hillary Clinton’s 2016 presidential campaign. Doug Heye is a Republican str...Show moreategist who served as deputy chief of staff to former House Majority Leader Eric Cantor. They join CNN Political Director David Chalian to share their takes on the debate, the candidates’ paths to 270 and how the campaigns could reach on-the-fence voters. Sep 13, 2024 The 2024 presidential race has reached a key turning point. Labor Day has passed, Election Day is just over eight weeks away, and the presidential nominees are set to face off on the debate stage in just a few days. New battleground state polls by CNN this week showed a very tight race between former President Donald Trump and Vice President Kamala Harris. Stuart Stevens is a former Republican consultant who worked on George W. Bush and Mitt Romney’s presidential campaigns. He’s now an author an...Show mored an advisor to the Lincoln Project — a group opposed to Donald Trump’s candidacy. He joins CNN Political Director David Chalian to discuss the state of the race. They talk potential strategies for next week’s debate, the sprint to Election Day and why Stevens thinks this race won’t be as close as many people predict. Sep 6, 2024 More than 36 million Latinos are eligible to vote in the 2024 election, and both Democrats and Republicans are competing fiercely to win their votes. Earlier this summer, polls showed former President Donald Trump could build significantly on gains he made with Latino voters in 2020. But, with Vice President Kamala Harris now at the top of the Democratic ticket, those numbers could be shifting. Mark Hugo Lopez is the director of race and ethnicity research at Pew Research Center. He joins CNN Political Director David Chalian to take a closer look at this critical voting bloc and how the political views of Latino voters have changed in recent years. Aug 30, 2024",
        "url": "https://edition.cnn.com/audio/podcasts/political-briefing",
        "label": 0
    },
    {
        "title": "Jackie Robinson’s life in pictures | CNN",
        "contents": "Every year on April 15, Major League Baseball comes together to commemorate the life of Jackie Robinson. Every player wears Robinson's number, 42, as they celebrate the man who made history as the first Black player in league history. Robinson made his debut on April 15, 1947, playing for the Brooklyn Dodgers. He went on to play 10 seasons, making six All-Star teams and winning a World Series with the Dodgers in 1955. He was also a National League batting champion and Most Valuable Player. All while enduring racist bigotry and death threats. His iconic number has been retired by every Major League team.",
        "url": "https://edition.cnn.com/2016/04/07/entertainment/gallery/jackie-robinson/index.html",
        "label": 1
    }
]